<?php

// +----------------------------------------------------------------------
// | JeoShi
// +----------------------------------------------------------------------
// | 版权所有 2019 深圳市卓士网络科技有限公司 [ http://www.jeoshi.com ]
// +----------------------------------------------------------------------
// | 官方网站: http://www.jeoshi.com
// +----------------------------------------------------------------------

return [
    // 应用调试模式
    'app_debug'      => true,
    // 应用Trace调试
    'app_trace'      => false,
    // URL参数方式 0 按名称成对解析 1 按顺序解析
    'url_param_type' => 1,
    // 注册的根命名空间
    'root_namespace'         => [
        'extend' => '..\extend'
    ],
];
