<?php

// +----------------------------------------------------------------------
// | JeoShi
// +----------------------------------------------------------------------
// | 版权所有 2019 深圳市卓士网络科技有限公司 [ http://www.jeoshi.com ]
// +----------------------------------------------------------------------
// | 官方网站: http://www.jeoshi.com
// +----------------------------------------------------------------------

return [
    // cookie 保存时间
    'expire'    => 1800,
    // cookie 启用安全传输
    'secure'    => false,
    // httponly 设置
    'httponly'  => true,
    // 是否使用 setcookie
    'setcookie' => true,
];