<?php

// +----------------------------------------------------------------------
// | JeoShi
// +----------------------------------------------------------------------
// | 版权所有 2019 深圳市卓士网络科技有限公司 [ http://www.jeoshi.com ]
// +----------------------------------------------------------------------
// | 官方网站: http://www.jeoshi.com
// +----------------------------------------------------------------------

/* 定义会话路径 */
$_path_ = env('runtime_path') . 'sess' . DIRECTORY_SEPARATOR;
file_exists($_path_) || mkdir($_path_, 0755, true);
$_name_ = 's' . substr(md5(__DIR__), -8);

/* 配置会话参数 */
return [
    'prefix' => 'fw',
    'path'   => $_path_,
    'name'   => $_name_,
    // 'var_session_id' => $_name_,
];